app/views/comments/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  <b>User:</b>
  <%= User.find(@comment.user_id).name %>