app/views/news/_form.html.erb

SELECT "read_messages".* FROM "read_messages" WHERE (user_id = 6)
---
                <ul>
                  <% @news.errors.full_messages.each do |msg| %>