app/views/news/_notification_refresh.html.erb

SELECT "news".* FROM "news" WHERE "news"."id" IN (9, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 27, 28, 29, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 53, 60, 61, 62, 63, 64, 65)
---
<%if session[:user_name]%>
    <%News.find(session[:user_name].unread_news(session[:user_name].id)).reverse[0..5].each do |a|%>