app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @user = User.find(params[:user_id])
    @news=News.find(params[:message_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "news".* FROM "news" WHERE "news"."id" IN (16, 17, 18, 19, 20, 23, 24, 26, 30, 54)

  def create

    @comment = Comment.new(params[:comment])
    @user = User.find(params[:user_id])
    @news = News.find(params[:message_id])
    @comment.news_id = @news.id
    @comment.user_id = @user.id
    @comment.name = @user.name
    respond_to do |format|
      if @comment.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "49"]]
INSERT INTO "comments" ("comment", "created_at", "name", "news_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "hjgjgjgjg"], ["created_at", Sat, 22 Nov 2014 11:25:35 UTC +00:00], ["name", nil], ["news_id", nil], ["updated_at", Sat, 22 Nov 2014 11:25:35 UTC +00:00], ["user_id", nil]]