app/controllers/news_controller.rb

  def show
    @news = News.find(params[:id])
    ReadMessage.create(:user_id => session[:user_name].id, :news_id => params[:id]) if session[:user_name] and params[:id]
---
SELECT "news".* FROM "news" WHERE "news"."id" IN (16, 17, 18, 19, 20, 23, 24, 26, 30, 54)
INSERT INTO "read_messages" ("created_at", "news_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Nov 2014 21:43:29 UTC +00:00], ["news_id", 10], ["updated_at", Fri, 21 Nov 2014 21:43:29 UTC +00:00], ["user_id", 6]]

  def edit
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" IN (14, 15, 21, 22, 25, 27, 28, 29, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 9)

  def create

    params[:news][:name].blank? ? (@news = News.new(params[:news])) : (@news = News.new(params[:news]))
    if session[:user_name].blank?
    @user = User.new
    @user.name = params[:news][:name]
    if @user.save and session[:user_name].blank?
---
SELECT "news".* FROM "news" WHERE "news"."id" IN (14, 15)
INSERT INTO "news" ("created_at", "data", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Nov 2014 20:21:06 UTC +00:00], ["data", "test text news"], ["name", "vishnu"], ["updated_at", Fri, 21 Nov 2014 20:21:06 UTC +00:00]]
INSERT INTO "news_users" ("news_id", "user_id") VALUES (?, ?)  [["news_id", 2], ["user_id", 0]]
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 21 Nov 2014 20:21:01 UTC +00:00], ["name", "vishnu"], ["updated_at", Fri, 21 Nov 2014 20:21:01 UTC +00:00]]

def clear_cookies
  session[:user_name] = nil
  session[:user_name] = ""
  @news=News.all
---
SELECT "news".* FROM "news"

  def destroy
    @news = News.find(params[:id])
    @news.destroy
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]